Revit 2027 API
DirectContext3DDocumentUtils.IsADirectContext3DHandleType Method
 Checks whether the provided Element ID corresponds to a DirectContext3D handle type element.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsADirectContext3DHandleType(
	Document aDocument,
	ElementId elementId
)
Public Shared Function IsADirectContext3DHandleType (
	aDocument As Document,
	elementId As ElementId
) As Boolean
public:
static bool IsADirectContext3DHandleType(
	Document^ aDocument,
	ElementId^ elementId
)
static member IsADirectContext3DHandleType :
        aDocument : Document *
        elementId : ElementId -> bool
Parameters
aDocument Document
 The document.
elementId ElementId
 The ID of the element to check.
Return Value
Boolean
 True, if the element is a valid DirectContext3D handle type, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  aDocument is not a project document. -or- elementId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
Remarks
DirectContext3D handle types are DirectShapeTypes.
See Also
Reference
DirectContext3DDocumentUtils Class
Autodesk.Revit.DB.DirectContext3D Namespace